//збираємо в html-колекцію всі кнопки на сторінці, 
//які відкривають модальні вікна через дата-атрибут(будь який атрибут з 
//таким дата-атрибутом буде добавлятися в дану колекцію)
let btns = document.querySelectorAll("*[data-modal-btn]");

//пройдемось по цій колекції і прив'яжемо до кожної кнопки 
//відповідне їй модальне вікно (за допомогою значення 
//дата-атрибуту (у кнопки і вікна назва дата-атрибуту різна, 
//але їх ЗНАЧЕННЯ - ОДНАКОВЕ))
for(let i = 0; i < btns.length; i++){
    // при кліку на кнопку з і-тим індексом стактує ф-ція
    btns[i].addEventListener('click', function(){
        //яка в змінну "name" передасть значення дата-атрибуту 
        //конкретної кнопки (і так для кожної кнопки по циклу)
        let name = btns[i].getAttribute('data-modal-btn');
        //в змінну "modal" передаємо об'єкт, (який ми шукаємо) у якого
        //значення дата-атрибуту відповідає змінній "name" (значенню дата-атрибуту кнопки)
        let modal = document.querySelector("[data-modal-window='"+name+"']");
        //тепер нашому модальному вікну в CSS призначаємо display:block;
        //так як в стилях в нього вказано display:none; 
        modal.style.display = "block";
        //змінну "close" прив'язуємо до"хрестика" через його клас, 
        //при нажимі буде закривати поточне вікно, так як всі 
        //події відбуваються в конкретному вікні з визначеним індексом
        let close = modal.querySelector(".close_modal_window");
        //до змінної добавляємо обробник подій addEventListener
        //вказуємо, що при кліку на хрестик запускається функція, яка змінній 
        //modal (а це є все наше модальне вікно) в CSS надасть display:none; 
        //бо перед цим , при відкритті вікна ми надавали display:block;;
        close.addEventListener('click', function(){
            modal.style.display = "none";
        })
    })
}
//закриття модального вікна на затемнену вільну зону
//при кліку на екран запускається ф-ція
window.onclick = function(e){
    //якщо клік зроблений  на об'єкт на екрані, у якого 
    //вказаний дата-атрибут "data-modal-window" то виконуэться умова
    if(e.target.hasAttribute('data-modal-window')){
        //створюється html-колекція в сіх модальних вікон з вказаним дата-атрибутом 
        let modals = document.querySelectorAll("*[data-modal-window]");
        //перебираються через цикл і закриваються черед додавання в стилі display:none;
        for(let i = 0; i< modals.length; i++){
            //так що будь-яке модю вікно з цим атрибутом буде закрито
            modals[i].style.display = "none";
        }
    }

}





